notifications_api/app/controllers/api/notifications_controller.rb

SELECT "notifications".* FROM "notifications"
---
    def index
        notifications = Notification.all

        if !notifications
            render json: {status: "failed", error: notifications.errors.objects.first.full_message}

UPDATE "notifications" SET "seen" = $1, "common_actions" = $2, "message" = $3, "selected" = $4, "updated_at" = $5 WHERE "notifications"."id" = $6  [["seen", false], ["common_actions", 1], ["message", "2 users liked your review for Jujutsu Kaisen"], ["selected", true], ["updated_at", "2023-01-09 01:45:01.536720"], ["id", 34]]
SELECT "notifications".* FROM "notifications" WHERE (target = 'review' AND target_id = 13 AND recipient = NULL AND updated_at > '2023-01-09 00:18:24.943744') ORDER BY "notifications"."updated_at" DESC
SELECT "notifications".* FROM "notifications" WHERE (notifications.target = 'review' AND notifications.target_id = 13 AND notifications.recipient = 'Jarret' AND notifications.updated_at > '2023-01-09 01:12:35.983074') ORDER BY "notifications"."updated_at" DESC
SELECT "notifications".* FROM "notifications" WHERE (notifications.target = 'review' AND notifications.target_id = 13 AND notifications.recipient = 'Jarret' AND notifications.updated_at > '2023-01-09 01:09:39.476706') ORDER BY "notifications"."updated_at" DESC
---
    def create
        notification = ActiveSupport::JSON.decode(notification_params[:notification])

        event_action = notification["action"].downcase
        target = notification["target_item"].downcase
        target_id = notification["id"]
        action_user = notification["action_user"]
        recipient = notification["recipient"]

        time_block = Time.now - 1.hour

        where_query = ""
        where_query += "notifications.target = ? "
        where_query += "AND notifications.target_id = ? "
        where_query += "AND notifications.recipient = ? "
        where_query += "AND notifications.updated_at > ?"

        exact_check = "target = ? AND target_id = ? AND recipient = ? AND action_user = ?"

        exact_notification = Notification.where([exact_check,target,target_id,recipient,action_user]).take

        similar_n = Notification.where([where_query,target,target_id,recipient,time_block]).order(updated_at: :desc)

        common_actions = similar_n.length > 0 ? similar_n.first.common_actions + 1 : 0

UPDATE "notifications" SET "seen" = $1, "common_actions" = $2, "message" = $3, "selected" = $4, "updated_at" = $5 WHERE "notifications"."id" = $6  [["seen", false], ["common_actions", 0], ["message", "Aviel liked your review for Jujutsu Kaisen"], ["selected", true], ["updated_at", "2023-01-09 02:12:46.118262"], ["id", 34]]
---
        message = write_notification(notification,common_actions)

        if exact_notification
            exact_notification.update({
                updated_at: Time.now,
                seen: false,
                common_actions: common_actions,
                message: message,
                selected: true
            })

UPDATE "notifications" SET "seen" = $1 WHERE "notifications"."id" IN (SELECT "notifications"."id" FROM "notifications" WHERE "notifications"."recipient" = $2 ORDER BY "notifications"."updated_at" DESC LIMIT $3)  [["seen", true], ["recipient", "Jarret"], ["LIMIT", 20]]
INSERT INTO "notifications" ("event_action", "target", "target_id", "action_user", "recipient", "seen", "common_actions", "message", "selected", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
            return
        end

        new_notification.save

SELECT "notifications".* FROM "notifications" WHERE "notifications"."recipient" = $1 ORDER BY "notifications"."updated_at" DESC  [["recipient", "Jarret"]]
---
    def show
        recipient = notification_params[:id]

        notifications = Notification.where(recipient: recipient).order(updated_at: :desc)

SELECT "notifications".* FROM "notifications" WHERE "notifications"."recipient" = $1 ORDER BY "notifications"."updated_at" DESC LIMIT $2  [["recipient", "Jarret"], ["LIMIT", 20]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."recipient" = $1 AND "notifications"."seen" = $2 ORDER BY "notifications"."updated_at" DESC LIMIT $3  [["recipient", "Aldane"], ["seen", false], ["LIMIT", 20]]
UPDATE "notifications" SET "seen" = $1 WHERE "notifications"."id" IN (SELECT "notifications"."id" FROM "notifications" WHERE "notifications"."recipient" = $2 ORDER BY "notifications"."updated_at" DESC LIMIT $3)  [["seen", true], ["recipient", "Aldane"], ["LIMIT", 20]]
---
    def update
        recipient = notification_params[:id]

        notifications = Notification.where(recipient: recipient).order(updated_at: :desc).limit(20)

        unseen_notifications = notifications.where(seen: false).length
        old_notifications = notifications[0...unseen_notifications]
        new_notifications = notifications[unseen_notifications..-1]

        notifications.update_all(seen: true)