likes_api/app/controllers/api/likes_controller.rb

    def create
        action = ActiveSupport::JSON.decode(like_params[:like_action])
        user = action["action_user"]
        item_type = action["target_item"]
        item_id = action["id"]
        upvote = action["action"] == "like"
        downvote = action["action"] == "unlike"

        like = Like.new({
            user: user,
            item_type: item_type,
            item_id: item_id,
            upvote: upvote,
            downvote: downvote
        })

        if like.invalid?
            render json: {status: "failed", error: like.errors.objects.first.full_message}
            return
        end

        like.save
---
INSERT INTO "likes" ("user", "item_type", "item_id", "upvote", "downvote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user", "Aldane"], ["item_type", "Review"], ["item_id", 28], ["upvote", true], ["downvote", false], ["created_at", "2023-01-06 18:55:37.913295"], ["updated_at", "2023-01-06 18:55:37.913295"]]

    def show
        item = like_params[:id]
        item_type = like_params[:item_type]

        where_query = ['item_type= ? AND item_id = ?',item_type,item]
        likes = Like.where(where_query)

        if likes.length == 0
---
SELECT "likes".* FROM "likes" WHERE (item_type= 'Review' AND item_id = '12')

    def update
        action = ActiveSupport::JSON.decode(like_params[:like_action])
        user = action["action_user"]
        item_type = action["target_item"]
        item_id = like_params[:id]
        upvote = action["action"] == "like"
        downvote = action["action"] == "unlike"


        where_text = 'likes.user= ? AND item_type= ? AND item_id = ?'
        where_query = [where_text,user,item_type,item_id]
        like = Like.where(where_query).take

        if !like
            render json: {status: "failed", error: "Could not find like to edit"}
            return
        end

        like.upvote = upvote
        like.downvote = downvote

        if like.invalid?
            render json: {status: "failed", error: like.errors.object.first.full_message}
            return
        end

        like.save
---
SELECT "likes".* FROM "likes" WHERE (likes.user= 'Aldane' AND item_type= 'Review' AND item_id = '21') LIMIT $1  [["LIMIT", 1]]
UPDATE "likes" SET "upvote" = $1, "downvote" = $2, "updated_at" = $3 WHERE "likes"."id" = $4  [["upvote", false], ["downvote", true], ["updated_at", "2024-10-21 13:21:50.171268"], ["id", 29]]

    def destroy
        action = ActiveSupport::JSON.decode(like_params[:like_action])
        user = action["action_user"]
        item_type = action["target_item"]
        item_id = like_params[:id]

        where_text = 'likes.user= ? AND item_type= ? AND item_id = ?'
        where_query = [where_text,user,item_type,item_id]
        like = Like.where(where_query).take

        if !like
            render json: {status: "failed", error: "Could not find like to edit"}
            return
        end

        deleted_like = like
        like.destroy
---
SELECT "likes".* FROM "likes" WHERE (likes.user= 'Aldane' AND item_type= 'Review' AND item_id = '28') LIMIT $1  [["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 6]]