show_ratings_api/app/controllers/api/show_ratings_controller.rb

SELECT "show_ratings".* FROM "show_ratings"
---
    def index
        shows = ShowRating.all

        if !shows
            render json: {status: "failed", error: shows.errors.objects.first.full_message}

INSERT INTO "show_ratings" ("show_title", "room_id", "reviewers", "total_points", "number_of_reviews", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        create_array = []
        if show_params[:review]
            review = ActiveSupport::JSON.decode(show_params[:review])
            rooms = ActiveSupport::JSON.decode(show_params[:rooms])
            create_objects = rooms.map do |room|
                {
                    room_id: room,
                    show_title:review["show"],
                    reviewers: {review["user"] => review["rating"]},
                    total_points: review["rating"],
                    number_of_reviews: 1
                }
            end
            create_array.push(create_objects)
        else
            reviews = ActiveSupport::JSON.decode(show_params[:reviews])
            room = show_params[:room_id]
            create_objects = reviews.map do |review|
                {
                    room_id: room,
                    show_title:review["show"],
                    reviewers: {review["user"] => review["rating"]},
                    total_points: review["rating"],
                    number_of_reviews: 1
                }
            end
            create_array.push(create_objects)
        end

        new_shows = ShowRating.create(create_array)

SELECT "show_ratings".* FROM "show_ratings" WHERE "show_ratings"."room_id" = $1 AND "show_ratings"."show_title" IN ($2, $3)  [["room_id", "Planet Vegeta"], ["show_title", "Hunter"], ["show_title", "Naruto"]]
SELECT "show_ratings".* FROM "show_ratings" WHERE "show_ratings"."room_id" = $1 AND "show_ratings"."show_title" = $2  [["room_id", "Planet Vegeta"], ["show_title", "Code Geass 14"]]
---
    def update
        show_ratings = nil
        update_hash = {}
        action = show_params[:show_action]

        if show_params[:review]
            review = ActiveSupport::JSON.decode(show_params[:review])
            user = review["user"]
            rooms = ActiveSupport::JSON.decode(show_params[:rooms])
            room_names = rooms.map { |room| room }

            show_ratings = ShowRating.where(room_id: room_names).where(show_title: review["show"])

            show_ratings.each do |rating|

SELECT "show_ratings".* FROM "show_ratings" WHERE "show_ratings"."room_id" = $1 AND "show_ratings"."show_title" IN ($2, $3)  [["room_id", "Planet Vegeta"], ["show_title", "Jujutsu Kaisen"], ["show_title", "Naruto"]]
---
            user = reviews[0]["user"]
            show_ratings = ShowRating.where(room_id: room).where(show_title: shows.keys)

            show_ratings.each do |rating|

UPDATE "show_ratings" SET "reviewers" = $1, "total_points" = $2, "number_of_reviews" = $3, "updated_at" = $4 WHERE "show_ratings"."id" = $5  [["reviewers", "{\"Jarret\":89,\"Aviel\":81}"], ["total_points", 170], ["number_of_reviews", 2], ["updated_at", "2023-01-05 20:10:57.361282"], ["id", 3]]
---
            end
        end

        new_shows = ShowRating.update(update_hash.keys,update_hash.values)

SELECT "show_ratings".* FROM "show_ratings" WHERE "show_ratings"."room_id" = $1 AND "show_ratings"."show_title" IN ($2, $3)  [["room_id", "Planet Vegeta"], ["show_title", "Jujutsu Kaisen"], ["show_title", "Naruto"]]
SELECT "show_ratings".* FROM "show_ratings" WHERE "show_ratings"."room_id" = $1 AND "show_ratings"."show_title" = $2  [["room_id", "Planet Vegeta"], ["show_title", "Code Geass 18"]]
SELECT "show_ratings".* FROM "show_ratings" WHERE "show_ratings"."room_id" = $1 AND "show_ratings"."show_title" = $2  [["room_id", "Planet Vegeta"], ["show_title", "Prison School"]]
DELETE FROM "show_ratings" WHERE "show_ratings"."id" = $1  [["id", 8]]
---
    def destroy
        ids = []

        if show_params[:review]
            review = ActiveSupport::JSON.decode(show_params[:review])
            rooms = ActiveSupport::JSON.decode(show_params[:rooms])

            show_ratings = ShowRating.where(room_id: rooms).where(show_title: review["show"])

            show_ratings.each { |show| ids.push(show.id)}

        else
            reviews = ActiveSupport::JSON.decode(show_params[:reviews])
            user = reviews[0]["user"]
            room = show_params[:room_id]

            shows = {}
            reviews.each { |review| shows[review["show"]] = review["rating"]}

            show_ratings = ShowRating.where(room_id: room).where(show_title: shows.keys)

            show_ratings.each { |show| ids.push(show.id)}
        end

        new_shows = ShowRating.delete(ids)